Documents/Renault_СписаниеНачислениеБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_СписаниеНачислениеБаллов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Renault_ОстаткиБаллов</xr:Item>
				<xr:Item>AccumulationRegister.DMS_БонусныеБаллы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоБалловНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБалловСписано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаСервис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогаситьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БаллыКСписанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БаллыКНачислению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/DMS_БонусныеБаллы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>DMS_БонусныеБаллы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСписанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВидыОперацийКартЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КартаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Renault_ОстаткиБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_ОстаткиБаллов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КартаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПогаситьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/DMS_ВидыОперацийКартЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ВидыОперацийКартЛояльности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаменаДисконтнойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаБонуснойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБаллов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБаллов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБалловРегламентно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаБонуснойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДисконтнойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБалловРегламентно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаКартыПриУтери</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратБаллов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_СписаниеНачислениеБаллов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	////{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//// Данный фрагмент построен конструктором.
	//// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//// регистр Renault_ОстаткиБаллов Расход
	//Движения.Renault_ОстаткиБаллов.Записывать = Истина;
	//Движения.Renault_ОстаткиБаллов.Очистить();
	//Движение = Движения.Renault_ОстаткиБаллов.Добавить();
	//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//Движение.Период = Дата;
	//Движение.КартаЛояльности = КартаЛояльности;
	//Движение.КоличествоБаллов = КоличествоБалловСписано;

	//// регистр Renault_ОстаткиБаллов Приход
	////Движения.Renault_ОстаткиБаллов.Записывать = Истина;
	////Движения.Renault_ОстаткиБаллов.Очистить();
	//Движение = Движения.Renault_ОстаткиБаллов.Добавить();
	//Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//Движение.Период = Дата;
	//Движение.КартаЛояльности = КартаЛояльности;
	//Движение.КоличествоБаллов = КоличествоБалловНачислено;
	//
	//Если ЗначениеЗаполнено(ПогаситьДо) Тогда
	//
	//	Движение.ПогаситьДо = ПогаситьДо;
	//	
	//КонецЕсли;
	//
	////}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачислениеБаллов.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	НачислениеБаллов.КартаЛояльности КАК КартаЛояльности,
		|	НачислениеБаллов.Контрагент КАК Контрагент,
		|	НачислениеБаллов.КартаЛояльности.ДилерскийЦентр КАК ДилерскийЦентр,
		|	НачислениеБаллов.КартаЛояльности.ПрограммаЛояльности КАК ПрограммаЛояльности,
		|	НачислениеБаллов.КоличествоБалловНачислено КАК Начислено,
		|	0 КАК КСписанию,
		|	ВЫБОР
		|		КОГДА НачислениеБаллов.ЭтоВозврат
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийКартЛояльности.ВозвратБаллов)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийКартЛояльности.НачислениеБаллов)
		|	КОНЕЦ КАК ВидОперации,
		|	НачислениеБаллов.ЗаказНаряд
		|ПОМЕСТИТЬ ТаблицаДвижений
		|ИЗ
		|	Документ.Renault_СписаниеНачислениеБаллов КАК НачислениеБаллов
		|ГДЕ
		|	НачислениеБаллов.Ссылка = &Ссылка
		|	И НачислениеБаллов.КоличествоБалловНачислено > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НачислениеБаллов.ПогаситьДо,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	НачислениеБаллов.КартаЛояльности,
		|	НачислениеБаллов.Контрагент,
		|	НачислениеБаллов.КартаЛояльности.ДилерскийЦентр,
		|	НачислениеБаллов.КартаЛояльности.ПрограммаЛояльности,
		|	0,
		|	НачислениеБаллов.КоличествоБалловНачислено,
		|	ВЫБОР
		|		КОГДА НачислениеБаллов.ЭтоВозврат
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийКартЛояльности.ВозвратБаллов)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийКартЛояльности.НачислениеБаллов)
		|	КОНЕЦ,
		|	НачислениеБаллов.ЗаказНаряд
		|ИЗ
		|	Документ.Renault_СписаниеНачислениеБаллов КАК НачислениеБаллов
		|ГДЕ
		|	НачислениеБаллов.Ссылка = &Ссылка
		|	И НачислениеБаллов.КоличествоБалловНачислено > 0
		|	И НачислениеБаллов.ПогаситьДо <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеБаллов.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	СписаниеБаллов.КартаЛояльности,
		|	СписаниеБаллов.Контрагент,
		|	СписаниеБаллов.КартаЛояльности.ДилерскийЦентр,
		|	СписаниеБаллов.КартаЛояльности.ПрограммаЛояльности,
		|	0,
		|	СписаниеБаллов.КоличествоБалловСписано,
		|	ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийКартЛояльности.СписаниеБаллов),
		|	СписаниеБаллов.ЗаказНаряд
		|ИЗ
		|	Документ.Renault_СписаниеНачислениеБаллов КАК СписаниеБаллов
		|ГДЕ
		|	СписаниеБаллов.Ссылка = &Ссылка
		|	И СписаниеБаллов.КоличествоБалловСписано > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеБаллов.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	СписаниеБаллов.КартаЛояльности,
		|	СписаниеБаллов.Контрагент,
		|	СписаниеБаллов.КартаЛояльности.ДилерскийЦентр,
		|	СписаниеБаллов.КартаЛояльности.ПрограммаЛояльности,
		|	СписаниеБаллов.КоличествоБалловСписано,
		|	0,
		|	ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийКартЛояльности.СписаниеБаллов),
		|	СписаниеБаллов.ЗаказНаряд
		|ИЗ
		|	Документ.Renault_СписаниеНачислениеБаллов КАК СписаниеБаллов
		|ГДЕ
		|	СписаниеБаллов.Ссылка = &Ссылка
		|	И СписаниеБаллов.КоличествоБалловСписано > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеБаллов.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	СписаниеБаллов.КартаЛояльности,
		|	СписаниеБаллов.Контрагент,
		|	СписаниеБаллов.КартаЛояльности.ДилерскийЦентр,
		|	СписаниеБаллов.КартаЛояльности.ПрограммаЛояльности,
		|	0,
		|	СписаниеБаллов.БаллыКСписанию,
		|	ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийКартЛояльности.СписаниеБалловРегламентно),
		|	СписаниеБаллов.ЗаказНаряд
		|ИЗ
		|	Документ.Renault_СписаниеНачислениеБаллов КАК СписаниеБаллов
		|ГДЕ
		|	СписаниеБаллов.Ссылка = &Ссылка
		|	И СписаниеБаллов.БаллыКСписанию > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеБаллов.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	СписаниеБаллов.КартаЛояльности,
		|	СписаниеБаллов.Контрагент,
		|	СписаниеБаллов.КартаЛояльности.ДилерскийЦентр,
		|	СписаниеБаллов.КартаЛояльности.ПрограммаЛояльности,
		|	СписаниеБаллов.БаллыКСписанию,
		|	0,
		|	ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийКартЛояльности.СписаниеБалловРегламентно),
		|	СписаниеБаллов.ЗаказНаряд
		|ИЗ
		|	Документ.Renault_СписаниеНачислениеБаллов КАК СписаниеБаллов
		|ГДЕ
		|	СписаниеБаллов.Ссылка = &Ссылка
		|	И СписаниеБаллов.БаллыКСписанию > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НачислениеБаллов.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	НачислениеБаллов.КартаЛояльности,
		|	НачислениеБаллов.Контрагент,
		|	НачислениеБаллов.КартаЛояльности.ДилерскийЦентр,
		|	НачислениеБаллов.КартаЛояльности.ПрограммаЛояльности,
		|	НачислениеБаллов.БаллыКНачислению,
		|	0,
		|	ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийКартЛояльности.НачислениеБалловРегламентно),
		|	НачислениеБаллов.ЗаказНаряд
		|ИЗ
		|	Документ.Renault_СписаниеНачислениеБаллов КАК НачислениеБаллов
		|ГДЕ
		|	НачислениеБаллов.Ссылка = &Ссылка
		|	И НачислениеБаллов.БаллыКНачислению > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НачислениеБаллов.ПогаситьДо,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	НачислениеБаллов.КартаЛояльности,
		|	НачислениеБаллов.Контрагент,
		|	НачислениеБаллов.КартаЛояльности.ДилерскийЦентр,
		|	НачислениеБаллов.КартаЛояльности.ПрограммаЛояльности,
		|	0,
		|	НачислениеБаллов.БаллыКНачислению,
		|	ЗНАЧЕНИЕ(Перечисление.DMS_ВидыОперацийКартЛояльности.НачислениеБалловРегламентно),
		|	НачислениеБаллов.ЗаказНаряд
		|ИЗ
		|	Документ.Renault_СписаниеНачислениеБаллов КАК НачислениеБаллов
		|ГДЕ
		|	НачислениеБаллов.Ссылка = &Ссылка
		|	И НачислениеБаллов.БаллыКНачислению > 0
		|	И НачислениеБаллов.ПогаситьДо <> ДАТАВРЕМЯ(1, 1, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Период,
		|	&Ссылка КАК Регистратор,
		|	ТаблицаДвижений.ВидДвижения,
		|	ТаблицаДвижений.КартаЛояльности,
		|	ТаблицаДвижений.Контрагент,
		|	ТаблицаДвижений.ДилерскийЦентр,
		|	ТаблицаДвижений.ПрограммаЛояльности,
		|	ТаблицаДвижений.Начислено,
		|	ТаблицаДвижений.КСписанию,
		|	ТаблицаДвижений.ВидОперации,
		|	ТаблицаДвижений.ЗаказНаряд
		|ИЗ
		|	ТаблицаДвижений КАК ТаблицаДвижений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеБаллов.Дата КАК Период,
		|	НачислениеБаллов.Ссылка КАК Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвижениянакопления.Приход) КАК ВидДвижения,
		|	НачислениеБаллов.КартаЛояльности КАК КартаЛояльности,
		|	НачислениеБаллов.ПогаситьДо КАК ПогаситьДо,
		|	НачислениеБаллов.КоличествоБалловНачислено КАК КоличествоБаллов
		|ИЗ
		|	Документ.Renault_СписаниеНачислениеБаллов КАК НачислениеБаллов
		|ГДЕ
		|	НачислениеБаллов.КоличествоБалловНачислено > 0
		|	И НачислениеБаллов.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеБаллов.Дата,
		|	СписаниеБаллов.Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвижениянакопления.Расход),
		|	СписаниеБаллов.КартаЛояльности,
		|	СписаниеБаллов.ПогаситьДо,
		|	СписаниеБаллов.КоличествоБалловСписано
		|ИЗ
		|	Документ.Renault_СписаниеНачислениеБаллов КАК СписаниеБаллов
		|ГДЕ
		|	СписаниеБаллов.КоличествоБалловСписано > 0
		|	И СписаниеБаллов.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеБаллов.Дата,
		|	СписаниеБаллов.Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвижениянакопления.Расход),
		|	СписаниеБаллов.КартаЛояльности,
		|	СписаниеБаллов.ПогаситьДо,
		|	СписаниеБаллов.БаллыКСписанию
		|ИЗ
		|	Документ.Renault_СписаниеНачислениеБаллов КАК СписаниеБаллов
		|ГДЕ
		|	СписаниеБаллов.БаллыКСписанию > 0
		|	И СписаниеБаллов.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НачислениеБаллов.Дата,
		|	НачислениеБаллов.Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвижениянакопления.Приход),
		|	НачислениеБаллов.КартаЛояльности,
		|	НачислениеБаллов.ПогаситьДо,
		|	НачислениеБаллов.БаллыКНачислению
		|ИЗ
		|	Документ.Renault_СписаниеНачислениеБаллов КАК НачислениеБаллов
		|ГДЕ
		|	НачислениеБаллов.БаллыКНачислению > 0
		|	И НачислениеБаллов.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Движения.DMS_БонусныеБаллы.Записывать 	  = Истина;
	Движения.Renault_ОстаткиБаллов.Записывать = Истина;
	
	Движения.DMS_БонусныеБаллы.Загрузить(РезультатЗапроса[1].Выгрузить());
	Движения.Renault_ОстаткиБаллов.Загрузить(РезультатЗапроса[2].Выгрузить());
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.Пользователь;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;	
КонецПроцедуры

#КонецЕсли
